{
  "investments": {
    "initial_value": "This is the initial deposit you put into the investment (whether or not this comes from a loan is irrelevant).",
    "purchase_fee": "This is a one-off fee associated with acquiring the asset. It does not contribute to the value of the investment.",
    "monthly_contribution": "This is the amount of money you put into the investment on a monthly basis in order to increase the value of the investment.",
    "growth_rate": "This is the rate by which the value of the investment grows with time as a percentage of the value of the investment.",
    "growth_rate_type": "This qualifies the growth rate: effective is the actual amount the investment grows per year (ignoring additional contributions), while nominal is a euphemism that is simply derived from the actual monthly growth rate multiplied by 12.",
    "annual_maintenance_cost": "This is the expense you must pay on a yearly basis just to keep hold of the asset. It does not contribute to the value of the asset.",
    "cash_out_fee": "This is a one-off fee associated with selling the asset and thereby pulling your cash out."
  },
  "loans": {
    "amount": "This is the initial amount you borrow.",
    "interest_rate": "This is the rate at which the amount you owe (your debt) increases as a percentage of the debt outstanding.",
    "interest_rate_type": "This qualifies the interest rate: effective is the actual amount the debt grows per year (ignoring monthly payments), while nominal is a euphemism that is simply derived from the actual monthly interest rate multiplied by 12.",
    "term": "This is the number of years over which you will pay back the loan. This affects your monthly payments."
  },
  "equity": "This is the amount of money you have stored in your investments minus the total debt you have yet to pay off.",
  "profit": "This is the amount of extra money you'd have at any given time compared to if you hadn't made any investments and instead had saved the cash you put into them.",
  "cash_available": "This is how much cash you have available at any given time if you cashed out on all of your investments and payed off all of your debts."
}
